{
  "navigation": {
    "home": "Home",
    "portfolio": "Portfolio",
    "techs": "Stack",
    "contacts": "Contacts",
    "resume": "Resume"
  },
  "home": {
    "greatings": "Hi, my name is",
    "pitch": "I am a passionate and versatile Full Stack Developer with over three years of experience, specialising in both front-end and back-end technologies.\n\nI have solid expertise in the Vue.js and JavaScript ecosystems, honed over two years in front-end development.\n\nDuring my last experience, I have expanded my skill set further by contributing to key projects at Symbol-It, particularly with Adeo Leroy Merlin, where I’ve played a pivotal role in optimizing transaction tunnels and enhancing supplier performance systems.\n\nMy curiosity and dedication drive me to continually grow, and I thrive in collaborative environments where I can contribute innovative solutions. Fluent in English, Italian, and French, I am eager to bring my diverse skill set to a forward-thinking development team.",
    "button": "Check out my projects",
    "position": "Full Stack Developer"
  },
  "portfolio": {
    "showDetails": "Show details",
    "closeDetails": "Close details",
    "months": [
      "Jan",
      "Feb",
      "Mar",
      "Apr",
      "May",
      "Jun",
      "Jul",
      "Aug",
      "Sep",
      "Oct",
      "Nov",
      "Dec"
    ],
    "functionalities": "Functionalities",
    "tododescr": "Simple Todo App - Responsive Design",
    "weatherdescr": "App to check the current weather in the city of user's choice - Responsive Design",
    "portfolio2Descr": "Personal Portfolio - Responsive Design",
    "ecommerce2Descr": "E-commerce website - Completely Mocked Customer Experience - Responsive Design",
    "adventDescr": "Collection of 24 Coding Challenges - Responsive Design",
    "socialDescr": "Social Network - Purely Frontend - Partially Mocked Customer Experience - Responsive Design",
    "portfolioDescr": "Personal Portfolio - Responsive Design",
    "moviesDescr": "Movie Streaming website - Purely Frontend - Responsive Design",
    "ecommerceDescr": "E-commerce website - Purely Frontend - Responsive Design",
    "htmlLayoutDescr": "Personal CV in HTML-email format - Responsive Design",
    "tooltipDescr": "A tool tip plugin with specific conditions and optional tasks - Responsive Design",
    "squareDescr": "Square following mouse with extra features",
    "technologies": "Technologies"
  },
  "resume": {
    "header": "Download my cv in your preferred language",
    "download": "download"
  }
}
