{
  "global": {
    "app-name--label": "Portfolio",
    "error": "An error occurred. Please try again later.",
    "select-language": "Select a language",
    "languages": {
      "en": "English",
      "fr": "French",
      "it": "Italian"
    }
  },
  "language-modal": {
    "selected--alt": "Selected language: {language}",
    "flag--alt": "{language} flag"
  },
  "navigation": {
    "welcome": "Welcome",
    "home": "Home",
    "portfolio": "Portfolio",
    "stack": "Stack",
    "contacts": "Contacts",
    "resume": "Resume",
    "logo--alt": "Navigation logo",
    "hamburger-close--label": "Close navigation menu",
    "hamburger-open--label": "Open navigation menu"
  },
  "welcome": {
    "introduction": "Welcome to {name}'s portfolio.",
    "access-home": "Go to Home",
    "cursor-animation--alt": "Cursor animation"
  },
  "home": {
    "greetings": "Hi, my name is",
    "pitch": "I am a passionate and versatile Full Stack Developer with over three years of experience, specializing in both front-end and back-end technologies.\n\nI have solid expertise in the Vue.js and JavaScript ecosystems, honed over two years of front-end development.\n\nDuring my recent experience, I expanded my skill set by contributing to key projects at Symbol-It, particularly with Adeo Leroy Merlin, where I played a pivotal role in optimizing transaction tunnels and enhancing supplier performance systems.\n\nMy curiosity and dedication drive me to continually grow, and I thrive in collaborative environments where I can contribute innovative solutions. Fluent in English, Italian, and French, I am eager to bring my diverse skill set to a forward-thinking development team.",
    "button": "Explore my projects",
    "position": "Full Stack Developer"
  },
  "portfolio": {
    "visit": "View project",
    "showDetails": "Show details",
    "closeDetails": "Close details",
    "github": "View code on GitHub",
    "months": [
      "Jan",
      "Feb",
      "Mar",
      "Apr",
      "May",
      "Jun",
      "Jul",
      "Aug",
      "Sep",
      "Oct",
      "Nov",
      "Dec"
    ],
    "tasks": "Tasks",
    "functionalities": "Functionalities",
    "stack": "Stack",
    "checkout-store": {
      "description": "As a full-stack developer at Leroy Merlin, I worked within the ELO team on the order funnel project, a multichannel solution aimed at transforming the in-store customer experience. I also contributed to several other projects in the same environment, including the development of front-end libraries, back-end architecture, and Back for Front (BFF).",
      "tasks": [
        {
          "title": "Task Design and Requirements Gathering",
          "description": "Collaborated with product managers, developers, and testers to understand project needs, define tasks, and assess technical feasibility."
        },
        {
          "title": "Front-End Development",
          "description": "Created responsive and accessible user interfaces with Vue.js, ensuring compliance with accessibility standards."
        },
        {
          "title": "Back-End Development and Back for Front (BFF)",
          "description": "Worked with Java in a back-end and Back for Front architecture, integrating multiple back-end systems to retrieve, aggregate, and map necessary data for the front-end."
        },
        {
          "title": "Cross-Team Collaboration",
          "description": "Collaborated closely with design, QA, and development teams to ensure consistency throughout the development cycle, from design to deployment."
        },
        {
          "title": "Task Management and Product Monitoring",
          "description": "Monitored the functionality of applications, assessed performance, and resolved issues to ensure system stability post-deployment."
        },
        {
          "title": "Performance Optimization",
          "description": "Optimized application performance by identifying bottlenecks and implementing solutions to enhance user experience."
        },
        {
          "title": "Testing",
          "description": "Conducted unit and integration tests to ensure the quality and reliability of the application."
        },
        {
          "title": "CI/CD Process",
          "description": "Implemented new features to the existing CI/CD process, such as SONARQUBE analysis to guarantee code quality."
        },
        {
          "title": "Tracking",
          "description": "Implemented tracking solutions to monitor user behavior and gather insights for future improvements."
        },
        {
          "title": "Critical User Journeys and Terraform Integration",
          "description": "Developed critical user journeys and integrated Terraform to manage infrastructure as code."
        },
        {
          "title": "Product Analysis Abroad",
          "description": "Participated in international business trips to analyze products on-site, gather stakeholder feedback, and refine solutions based on real use cases."
        }
      ]
    },
    "stocky": {
      "description": "Stocky is a web application designed to simplify equipment fleet management. The application provides access to the fleet, its management, usage statistics, and billing.",
      "tasks": [
        {
          "title": "Team Collaboration",
          "description": "Collaborated within a team comprising a PO, a back-end tech lead, three full-stack developers, and a QA specialist."
        },
        {
          "title": "Conception",
          "description": "Designed the front-end and back-end architecture, ensuring seamless integration."
        },
        {
          "title": "CI/CD Process",
          "description": "Implemented Docker images to streamline deployment and environment management."
        },
        {
          "title": "Deployment",
          "description": "Deployed the application efficiently using Fly.io, ensuring optimal availability."
        },
        {
          "title": "Database Management",
          "description": "Built a robust PostgreSQL database using CockroachDB for enhanced data reliability."
        },
        {
          "title": "Front-End Development",
          "description": "Developed the front-end, prioritizing user experience and ease of use."
        },
        {
          "title": "Back-End Development",
          "description": "Developed the back-end, ensuring robust functionality and performance."
        },
        {
          "title": "Testing",
          "description": "Configured the CI/CD process to automate testing and deployment for efficient application lifecycle management."
        }
      ]
    },
    "scpt-360": {
      "description": "As a front-end developer at Adeo Leroy Merlin, I collaborated with a multidisciplinary team on a global application for monitoring supplier performance. This application provides tailored user experiences based on roles, focusing on key performance indicators.",
      "tasks": [
        {
          "title": "Collaborative Team Environment",
          "description": "Worked alongside a team comprising a back-end developer, a tech lead, a designer, a quality tester, a data scientist, and a digital product leader."
        },
        {
          "title": "Integration with Java SpringBoot",
          "description": "Gained front-end development experience while integrating with a back-end environment built using Java SpringBoot."
        },
        {
          "title": "Development of Charts",
          "description": "Created dynamic charts using vue-chart.js and chart.js technologies to visualize data effectively."
        },
        {
          "title": "Design System Contribution",
          "description": "Contributed to the development and enhancement of ADEO's internal design system for consistency and scalability."
        },
        {
          "title": "Internationalization",
          "description": "Handled application internationalization using i18n for multilingual support."
        },
        {
          "title": "Quality Assurance Testing",
          "description": "Conducted rigorous testing prior to deployment to uphold high application quality standards."
        },
        {
          "title": "Deployment",
          "description": "Deployed the application within ADEO's micro-frontend framework, Kobi, ensuring seamless integration and functionality."
        },
        {
          "title": "Collaboration and Meetings",
          "description": "Collaborated with designers and QA testers during multiple meetings to refine and validate designs and functionalities."
        },
        {
          "title": "Agile Scrum Methodology",
          "description": "Adhered to Agile Scrum practices, participating in regular meetings to discuss user stories and ensure consistent progress."
        }
      ]
    },
    "symbol-it": {
      "description": "I worked on internal projects at Symbol-IT, including the RUN and BUILD phases of various JS projects.",
      "tasks": [
        {
          "title": "Colexpress",
          "description": "Developed an order and billing solution for a logistics company."
        },
        {
          "title": "Proch’Orientation (Hauts de France Region)",
          "description": "Contributed to the front-end RUN of tools guiding young individuals in the Hauts de France region."
        },
        {
          "title": "For Each Academy",
          "description": "Created a Discord bot and API integrations for automated processes (channel creation, member addition, etc.)."
        },
        {
          "title": "For Each Academy",
          "description": "Developed an application to manage student progress."
        }
      ]
    },
    "todo": {
      "description": "Simple Todo App - Responsive Design"
    },
    "weather": {
      "description": "App to check the current weather in the city of user's choice - Responsive Design"
    },
    "portfolio-vite": {
      "description": "Personal Portfolio - Responsive Design"
    },
    "e-commerce-2": {
      "description": "E-commerce website - Completely Mocked Customer Experience - Responsive Design"
    },
    "advent": {
      "description": "Collection of 24 Coding Challenges - Responsive Design"
    },
    "social": {
      "description": "Social Network - Purely Frontend - Partially Mocked Customer Experience - Responsive Design"
    },
    "portfolio": {
      "description": "Personal Portfolio - Responsive Design"
    },
    "streaming": {
      "description": "Movie Streaming website - Purely Frontend - Responsive Design"
    },
    "e-commerce": {
      "description": "E-commerce website - Purely Frontend - Responsive Design"
    },
    "email-layout": {
      "description": "Personal CV in HTML-email format - Responsive Design"
    },
    "tooltip": {
      "description": "A tool tip plugin with specific conditions and optional tasks - Responsive Design"
    },
    "square-task": {
      "description": "Square following mouse with extra features"
    }
  },
  "contacts": {
    "copy-clipboard-success": "Copied to clipboard.",
    "copy-clipboard-error": "Failed to copy to clipboard.",
    "copy-clipboard--alt": "Copy to clipboard icon",
    "copy-clipboard-success--alt": "Copied successfully to clipboard",
    "copy-clipboard-error--alt": "Failed to copy to clipboard",
    "email--alt": "Email icon",
    "phone--alt": "Phone icon",
    "linkedin--alt": "LinkedIn icon"
  },
  "resume": {
    "header": "Download my cv in your preferred language",
    "download": "download",
    "flag--alt": "{language} cv"
  }
}
