{
  "global": {
    "error": "An error occurred. Please try again later.",
    "select-language": "Select a language"
  },
  "navigation": {
    "home": "Home",
    "portfolio": "Portfolio",
    "stack": "Stack",
    "contacts": "Contacts",
    "resume": "Resume"
  },
  "welcome": {
    "introduction": "Welcome to {name}'s portfolio",
    "access-home": "Access Home"
  },
  "home": {
    "greatings": "Hi, my name is",
    "pitch": "I am a passionate and versatile Full Stack Developer with over three years of experience, specialising in both front-end and back-end technologies.\n\nI have solid expertise in the Vue.js and JavaScript ecosystems, honed over two years in front-end development.\n\nDuring my last experience, I have expanded my skill set further by contributing to key projects at Symbol-It, particularly with Adeo Leroy Merlin, where I’ve played a pivotal role in optimizing transaction tunnels and enhancing supplier performance systems.\n\nMy curiosity and dedication drive me to continually grow, and I thrive in collaborative environments where I can contribute innovative solutions. Fluent in English, Italian, and French, I am eager to bring my diverse skill set to a forward-thinking development team.",
    "button": "Check out my projects",
    "position": "Full Stack Developer"
  },
  "portfolio": {
    "visit": "Check out the project",
    "showDetails": "Show details",
    "closeDetails": "Close details",
    "github": "Checkout out the code",
    "months": [
      "Jan",
      "Feb",
      "Mar",
      "Apr",
      "May",
      "Jun",
      "Jul",
      "Aug",
      "Sep",
      "Oct",
      "Nov",
      "Dec"
    ],
    "functionalities": "Functionalities",
    "tododescr": "Simple Todo App - Responsive Design",
    "weatherdescr": "App to check the current weather in the city of user's choice - Responsive Design",
    "portfolio2Descr": "Personal Portfolio - Responsive Design",
    "ecommerce2Descr": "E-commerce website - Completely Mocked Customer Experience - Responsive Design",
    "adventDescr": "Collection of 24 Coding Challenges - Responsive Design",
    "socialDescr": "Social Network - Purely Frontend - Partially Mocked Customer Experience - Responsive Design",
    "portfolioDescr": "Personal Portfolio - Responsive Design",
    "moviesDescr": "Movie Streaming website - Purely Frontend - Responsive Design",
    "ecommerceDescr": "E-commerce website - Purely Frontend - Responsive Design",
    "htmlLayoutDescr": "Personal CV in HTML-email format - Responsive Design",
    "tooltipDescr": "A tool tip plugin with specific conditions and optional tasks - Responsive Design",
    "squareDescr": "Square following mouse with extra features",
    "stack": "Stack",
    "checkout-store": "As a full-stack developer at Leroy Merlin, I worked within the ELO team on the Checkout Store project, a multichannel solution aimed at transforming the in-store customer experience. I have also contributed to several other projects within the same environment, including the development of front-end libraries, back-end architecture, and Back for Front (BFF).",
    "stocky": "Stocky is a web application designed to simplify equipment fleet management. The application provides access to the fleet, its management, usage statistics, and billing for the equipment.",
    "scpt-360": "As a front-end developer at Adeo Leroy Merlin, the multidisciplinary team collaborates on a global application for monitoring supplier performance. This application provides tailored experiences for users based on their roles, with a particular focus on key performance indicators.",
    "symbol-it": "I’ve worked for the internal projects of the agency Symbol-IT. This includes the RUN and BUILD of multiple JS projects:\n\n- Colexpress: Order and billing solution for a logistics company\n- Proch’Orientation (Hauts de France Region): Tools for the guidance of young people in the Hauts de France region. I participated in the front-end run of the application\n- For Each Academy: Creation of a Discord bot and API integration for processes (channel creation, member addition, etc.)\n- For Each Academy: Creation of an application for the management of students' progress"
  },
  "contacts": {
    "copy-clipboard-success": "Copied to clipboard.",
    "copy-clipboard-error": "Failed to copy to clipboard.",
    "copy-clipboard--alt": "Copy to clipboard",
    "copy-clipboard-success--alt": "Copied successfully to clipboard",
    "copy-clipboard-error--alt": "Failed to copy to clipboard"
  },
  "resume": {
    "header": "Download my cv in your preferred language",
    "download": "download",
    "flag--alt": "Flag of {language}"
  }
}
