{
  "global": {
    "app-name--label": "Portefeuille",
    "error": "Une erreur s'est produite. Veuillez réessayer plus tard.",
    "select-language": "Sélectionnez une langue",
    "languages": {
      "en": "Anglais",
      "fr": "Français",
      "it": "Italien"
    }
  },
  "language-modal": {
    "selected--alt": "Langue sélectionnée {language}",
    "flag--alt": "Drapeau {language}"
  },
  "navigation": {
    "welcome": "Bienvenue",
    "home": "Accueil",
    "portfolio": "Portefeuille",
    "stack": "Stack",
    "contacts": "Contacts",
    "resume": "Résumé",
    "hamburger-close--label": "Fermer le menu de navigation",
    "hamburger-open--label": "Ouvrir le menu de navigation"
  },
  "welcome": {
    "introduction": "Bienvenue sur le portefeuille de {name}",
    "access-home": "Accéder à l'accueil",
    "cursor-animation--alt": "Animation du curseur"
  },
  "home": {
    "greetings": "Bonjour, mon prénom est",
    "pitch": "Développeur Full Stack passionné et polyvalent, je maîtrise à la fois les technologies front-end et back-end. Spécialisé dans l'écosystème Vue.js et JavaScript côté front, ainsi qu'en Java côté back-end, j'interviens efficacement sur l’ensemble du cycle de développement.\n\nAu sein de Symbol-It, j’ai contribué à des projets d’envergure, notamment pour Adeo Leroy Merlin, en travaillant sur l’optimisation des stocks, l’amélioration des tunnels de transaction et la performance des systèmes fournisseurs. Ces expériences m'ont permis de consolider mes compétences techniques tout en développant une approche centrée sur la valeur métier.\n\nAnimé par la curiosité et le souci du détail, j’évolue avec enthousiasme dans des environnements collaboratifs où l’innovation et l’échange sont au cœur des pratiques. Trilingue en français, anglais et italien, je mets un point d'honneur à favoriser une communication claire et fluide au sein des équipes.",
    "button": "Découvre mes projets",
    "position": "Développeur Full Stack"
  },
  "portfolio": {
    "visit": "Découvrez le projet",
    "studyProjectTitle": "Projets d'études",
    "workExperiencesTitle": "Experiences Professionnelles",
    "showDetails": "Afficher les détails",
    "closeDetails": "Cacher les détails",
    "github": "Découvrez le code",
    "tasks": "Tâches",
    "functionalities": "Fonctionnalités",
    "stack": "Stack",
    "months": [
      "Jan",
      "Fév",
      "Mar",
      "Avr",
      "Mai",
      "Jui",
      "Jul",
      "Aou",
      "Sep",
      "Oct",
      "Nov",
      "Déc"
    ],
    "leve": {
      "role": "Développeur Frontend",
      "company": "Projet Personnel",
      "description": "Création d'une application web Angular moderne et minimaliste qui permet aux utilisateurs d’explorer, filtrer et visualiser les festivals à travers la France en utilisant l’API open data officielle OpenEventDatabase / Ministère de la Culture."
    },
    "logistic-site-assortment-manager": {
      "role": "Développeur Full Stack",
      "company": "Leroy Merlin",
      "description": "En tant que développeur Full Stack chez Leroy Merlin, je travaille sur une application d’optimisation des stocks qui simplifie le processus de validation des assortiments. Le système, basé sur un mécanisme d’entrée/sortie, utilise Kafka, des notifications et PostgreSQL pour recevoir des recommandations d’assortiment et gérer le flux de travail permettant aux collaborateurs de valider, rejeter ou confirmer les assortiments avant leur envoi à la chaîne d’approvisionnement.",
      "tasks": [
        {
          "title": "Conception fonctionnelle et collecte des besoins",
          "description": "Collaboration avec les chefs de produit, les développeurs et les testeurs pour définir les fonctionnalités des outils de la chaîne d’approvisionnement, analyser les besoins métier et poser les bases de l’architecture de l’application."
        },
        {
          "title": "Développement Backend et Base de Données",
          "description": "Conception et développement de services backend en Java, modélisation de la base de données PostgreSQL et implémentation de requêtes pour une gestion efficace des données."
        },
        {
          "title": "Kafka et Synchronisation des Données",
          "description": "Mise en place de producteurs/consommateurs Kafka multi-sujets pour synchroniser les flux de données entre différentes entités métier, avec gestion des erreurs Kafka pour assurer la fiabilité et la résilience des échanges."
        },
        {
          "title": "Google Cloud Integration",
          "description": "Implémenté avec le fournisseur Terraform, les services Google Cloud pour la synchronisation des données via des buckets et des notifications pub/sub."
        },
        {
          "title": "Architecture et Intégration",
          "description": "Contribution à l’architecture technique, à la conception des API et à la structuration des interactions entre composants dans le cadre d'une architecture hexagonale, afin de garantir la performance et la scalabilité."
        },
        {
          "title": "Collaboration interéquipes",
          "description": "Travail en étroite collaboration avec d’autres équipes de développement pour construire un produit cohérent sur les plans technique et fonctionnel."
        },
        {
          "title": "Outils et Déploiement ",
          "description": "Configuration des environnements, sélection des technologies, automatisation des processus de build et de déploiement, et mise en place des pipelines CI/CD."
        }
      ]
    },
    "my-music-vault": {
      "role": "Développeur Frontend",
      "company": "Projet Personnel",
      "description": "Dans le but d'apprendre AngularJS, j'ai développé une application de bibliothèque musicale qui permet aux utilisateurs de gérer leurs chansons et playlists préférées."
    },
    "checkout-store": {
      "role": "Développeur Full Stack",
      "company": "Leroy Merlin",
      "description": "En tant que développeur fullstack chez Leroy Merlin, j'ai travaillé au sein de l’équipe ELO sur le projet du tunnel de commande, une solution multicanale visant à transformer l'expérience client en magasin. J’ai également contribué à plusieurs autres projets dans le même environnement, incluant le développement de libraries front-end, l’architecture back-end et le Back for Front (BFF).",
      "tasks": [
        {
          "title": "Conception des Tâches et Collecte des Exigences",
          "description": "Collaborer avec les chefs de produit, développeurs et testeurs pour comprendre les besoins du projet, définir les tâches et évaluer la faisabilité technique."
        },
        {
          "title": "Développement Frontend",
          "description": "Créer des interfaces utilisateur réactives et accessibles avec Vue.js, en veillant au respect des normes d'accessibilité."
        },
        {
          "title": "Développement Backend et Back for Front (BFF)",
          "description": "Développement backend avec Java dans une architecture Back for Front, intégrant plusieurs systèmes backend pour récupérer, agréger et mapper les informations destinées au frontend."
        },
        {
          "title": "Collaboration Inter-Équipes",
          "description": "Collaborer avec les équipes de design, QA et développement pour assurer une cohérence tout au long du cycle de développement, de la conception au déploiement."
        },
        {
          "title": "Gestion des Tâches et Surveillance des Produits",
          "description": "Superviser le fonctionnement des applications, surveiller les performances et résoudre rapidement les problèmes pour garantir la stabilité des systèmes après le déploiement."
        },
        {
          "title": "Optimisation des Performances",
          "description": "Optimiser les performances des applications en réduisant les temps de chargement, en minimisant les requêtes réseau et en améliorant l'expérience utilisateur."
        },
        {
          "title": "Tests et Qualité",
          "description": "Effectuer des tests unitaires et d'intégration pour garantir la qualité du code et la fiabilité des applications."
        },
        {
          "title": "Processus CI/CD",
          "description": "Mettre en place des pipelines CI/CD pour automatiser le processus d'analyse du code avec Sonarqube et garantir un déploiement continu et fiable."
        },
        {
          "title": "Tracking",
          "description": "Utilisation d’un système de déclenchement d’événements dans le code pour enregistrer et analyser les interactions des utilisateurs avec l’application."
        },
        {
          "title": "Critical User Journeys et Terraform",
          "description": "Développer des scénarios critiques pour tester les fonctionnalités clés de l'application et automatiser le déploiement avec Terraform."
        },
        {
          "title": "Analyse des Produits à l'Étranger",
          "description": "Participer à des déplacements professionnels internationaux pour analyser les produits sur place, recueillir les retours des parties prenantes et affiner les solutions en fonction des cas d’usage réels."
        }
      ]
    },
    "stocky": {
      "role": "Développeur Full Stack",
      "company": "Storfy",
      "description": "Stocky est une application Web visant à simplifier la gestion de parc de matériel. L’application donne accès au parc, sa gestion, des statistiques d'utilisation et la facturation de ce matériel.",
      "tasks": [
        {
          "title": "Collaboration d'Équipe",
          "description": "L'équipe est composée d'un PO, d'un tech lead back-end, de trois développeurs full-stack et d'un QA."
        },
        {
          "title": "Conception",
          "description": "Concevoir l'architecture front-end et back-end, en garantissant une intégration fluide."
        },
        {
          "title": "Processus CI/CD",
          "description": "Mise en œuvre des images Docker pour simplifier le déploiement et la gestion des environnements."
        },
        {
          "title": "Déploiement",
          "description": "Déploiement efficace de l'application avec Fly.io, en garantissant une disponibilité optimale."
        },
        {
          "title": "Gestion de Base de Données",
          "description": "Création d'une base de données PostgresSQL robuste à l'aide de CockroachDB pour garantir la fiabilité des données."
        },
        {
          "title": "Développement Front-End",
          "description": "Développement actif du front-end, en se concentrant sur l'expérience utilisateur et la facilité d'utilisation."
        },
        {
          "title": "Développement Back-End",
          "description": "Développement du back-end pour assurer une fonctionnalité solide et des performances optimales."
        },
        {
          "title": "Tests",
          "description": "Configuration complète du processus CI/CD pour automatiser les tests et le déploiement, garantissant une gestion efficace du cycle de vie de l'application."
        }
      ]
    },
    "scpt-360": {
      "role": "Développeur Frontend",
      "company": "Leroy Merlin",
      "description": "En tant que développeur frontend chez Adeo Leroy Merlin, l'équipe multidisciplinaire collabore sur une application mondiale de surveillance des performances des fournisseurs. Cette application offre des expériences adaptées aux utilisateurs en fonction de leur rôle, avec une attention particulière aux indicateurs clés de performance.",
      "tasks": [
        {
          "title": "Environnement Collaboratif d'Équipe",
          "description": "Travaillé au sein d'une équipe composée d'un développeur back-end, d'un tech lead, d'un designer, d'un testeur qualité, d'un data scientist et d'un chef de produit digital."
        },
        {
          "title": "Intégration avec Java SpringBoot",
          "description": "Acquis de l'expérience en développement front-end tout en intégrant un environnement back-end construit avec Java SpringBoot."
        },
        {
          "title": "Développement de Graphiques",
          "description": "Création de divers graphiques dynamiques à l'aide des technologies vue-chart.js et chart.js pour visualiser efficacement les données."
        },
        {
          "title": "Contribution au Design System",
          "description": "Collaboration active au développement et à l'amélioration du design system interne d'ADEO pour garantir la cohérence et l'évolutivité."
        },
        {
          "title": "Internationalisation",
          "description": "Géré l'internationalisation de l'application avec i18n pour assurer un support multilingue destiné aux utilisateurs internationaux."
        },
        {
          "title": "Tests de Qualité",
          "description": "Effectué des tests rigoureux avant le déploiement pour maintenir des normes de qualité élevées pour l'application."
        },
        {
          "title": "Déploiement",
          "description": "Déployé l'application dans le cadre du micro-frontend interne d'ADEO, Kobi, en assurant une intégration fluide et fonctionnelle."
        },
        {
          "title": "Collaboration et Réunions",
          "description": "Participé activement à des réunions avec le designer et le testeur QA pour affiner et valider les designs et les fonctionnalités."
        },
        {
          "title": "Méthodologie Agile Scrum",
          "description": "Suivi des pratiques Agile Scrum, en participant à des réunions régulières pour discuter des user stories et garantir une progression continue et alignée avec les objectifs du projet."
        }
      ]
    },
    "symbol-it": {
      "role": "Développeur Full Stack",
      "company": "Symbol-IT",
      "description": "J'ai travaillé sur les projets internes de l'agence Symbol-IT, incluant le RUN et le BUILD de plusieurs projets JS.",
      "tasks": [
        {
          "title": "Colexpress",
          "description": "Une solution de commande et de facturation pour une entreprise logistique."
        },
        {
          "title": "Proch’Orientation (Hauts de France Region)",
          "description": "Des outils d'orientation pour les jeunes où j'ai contribué au RUN front-end de l'application."
        },
        {
          "title": "For Each Academy",
          "description": "Création d'un bot Discord et intégration API pour des processus (création de canaux, ajout de membres, etc.)."
        },
        {
          "title": "For Each Academy",
          "description": "Développement d'une application pour la gestion de la progression des étudiants."
        }
      ]
    },
    "todo": {
      "description": "Simple Todo App - Responsive Design"
    },
    "weather": {
      "description": "App pour vérifier la météo actuelle, d'une ville choisi par l'utilisateur - Responsive Design"
    },
    "portfolio-vite": {
      "description": "Portefeuille Personnel - Responsive Design"
    },
    "e-commerce-2": {
      "description": "Site de e-commerce - Expérience client complètement moquée - Responsive Design"
    },
    "advent": {
      "description": "Collection de 24 défis de codage - Responsive Design"
    },
    "social": {
      "description": "Social Network - Expérience client partiellement moquée - Responsive Design"
    },
    "portfolio": {
      "description": "Portefeuille Personnel - Responsive Design"
    },
    "streaming": {
      "description": "Site de Film en Streaming - Responsive Design"
    },
    "e-commerce": {
      "description": "Site de e-commerce - Responsive Design"
    },
    "email-layout": {
      "description": "CV personnel en format HTML-email - Responsive Design"
    },
    "tooltip": {
      "description": "Un tooltip plugin avec des conditions spécifiques et des tâches facultatives - Responsive Design"
    },
    "square-task": {
      "description": "Carré qu'il suit la souris avec caractéristiques supplémentaires"
    }
  },
  "contacts": {
    "copy-clipboard-success": "Copié dans le presse-papiers.",
    "copy-clipboard-error": "Échec de la copie dans le presse-papiers.",
    "copy-clipboard--alt": "Icône pour copier dans le presse-papiers",
    "copy-clipboard-success--alt": "Copié dans le presse-papiers",
    "copy-clipboard-error--alt": "Impossible de copier dans le presse-papiers.",
    "email--alt": "Icône pour envoyer un email",
    "phone--alt": "Icône pour appeler",
    "linkedin--alt": "Icône pour visiter mon profil LinkedIn"
  },
  "resume": {
    "header": "Téléchargez mon CV dans la langue de votre choix.",
    "download": "Télécharger",
    "flag--alt": "Cv en {language}"
  }
}
