{
  "global": {
    "app-name--label": "Portfolio",
    "error": "Si è verificato un errore. Riprova più tardi.",
    "select-language": "Seleziona una lingua",
    "languages": {
      "en": "Inglese",
      "fr": "Francese",
      "it": "Italiano"
    }
  },
  "language-modal": {
    "selected--alt": "Lingua selezionata {language}",
    "flag--alt": "Bandiera {language}"
  },
  "navigation": {
    "welcome": "Benvenuto",
    "home": "Home",
    "portfolio": "Portfolio",
    "stack": "Stack",
    "contacts": "Contatti",
    "resume": "Cv",
    "hamburger-close--label": "Chiudi il menu di navigazione",
    "hamburger-open--label": "Apri il menu di navigazione"
  },
  "welcome": {
    "introduction": "Benvenuti nel portfolio di {name}",
    "access-home": "Accedi alla Home",
    "cursor-animation--alt": "Animazione del cursore"
  },
  "home": {
    "greatings": "Ciao, il mio nome é",
    "pitch": "Sono uno sviluppatore Full Stack appassionato e versatile, con oltre tre anni di esperienza, specializzato sia in tecnologie front-end che back-end.\n\nHo acquisito una solida esperienza nell'ecosistema Vue.js e JavaScript, maturata in due anni di sviluppo front-end.\n\nDurante la mia ultima esperienza lavorativa, ho ampliato ulteriormente le mie competenze contribuendo a progetti chiave presso Symbol-It, in particolare con Adeo Leroy Merlin, dove ho avuto un ruolo centrale nell'ottimizzazione dei tunnel di transazione e nel miglioramento dei sistemi di valutazione dei fornitori.\n\nLa mia curiosità e dedizione mi spingono a crescere continuamente, e mi trovo a mio agio in ambienti collaborativi dove posso offrire soluzioni innovative. Fluente in inglese, italiano e francese, sono pronto a mettere le mie competenze a disposizione di un team di sviluppo all'avanguardia.",
    "button": "Scopri i miei progetti",
    "position": "Full Stack Developer"
  },
  "portfolio": {
    "visit": "Scopri il progetto",
    "showDetails": "Scopri i dettagli",
    "closeDetails": "Chiudi i dettagli",
    "github": "Scopri il codice",
    "months": [
      "Gen",
      "Feb",
      "Mar",
      "Apr",
      "Mag",
      "Giu",
      "Lug",
      "Ago",
      "Set",
      "Ott",
      "Nov",
      "Dic"
    ],
    "functionalities": "Funzionalitá",
    "tododescr": "Todo App - Responsive Design",
    "weatherdescr": "App per verificare il meteo attuale di una città scelta dall'utilizzatore - Responsive Design",
    "portfolio2Descr": "Portfolio Personale - Responsive Design",
    "ecommerce2Descr": "Sito di e-commerce - Esperienza cliente completamente simulata - Responsive Design",
    "adventDescr": "Collzione di 24 sfide coding - Responsive Design",
    "socialDescr": "Social Network - Esperienza cliente parzialmente simulata - Responsive Design",
    "portfolioDescr": "Portfolio Personale - Responsive Design",
    "moviesDescr": "Sito di Film in Streaming - Responsive Design",
    "ecommerceDescr": "Sito di e-commerce - Responsive Design",
    "htmlLayoutDescr": "CV personale in formato HTML-email - Responsive Design",
    "tooltipDescr": "Un tooltip plugin con delle condizioni specifiche e compiti facoltativi - Responsive Design",
    "squareDescr": "Quadrato che segue il mouse con caratteristiche extra",
    "stack": "Stack",
    "checkout-store": "In qualità di sviluppatore full-stack presso Leroy Merlin, ho lavorato con il team ELO al progetto Checkout Store, una soluzione multicanale progettata per rivoluzionare l'esperienza in negozio, contribuendo anche allo sviluppo di librerie front-end, architetture back-end e sistemi Back for Front (BFF).",
    "stocky": "Stocky è un'applicazione web progettata per semplificare la gestione delle attrezzature informatiche. L'applicazione consente l'accesso al parco, la sua gestione, le statistiche di utilizzo e la fatturazione delle attrezzature.",
    "scpt-360": "In qualità di sviluppatore frontend presso Adeo Leroy Merlin, il team multidisciplinare collabora allo sviluppo di un'applicazione globale per il monitoraggio delle prestazioni dei fornitori. Questa applicazione offre esperienze personalizzate agli utenti in base al loro ruolo, con un'attenzione particolare agli indicatori chiave di prestazione.",
    "symbol-it": "Ho lavorato ai progetti interni dell'agenzia Symbol-IT, includendo il RUN e il BUILD di diversi progetti JS:\n\n- Colexpress: Una soluzione per ordini e fatturazione per un'azienda logistica\n- Proch’Orientation (Regione Hauts-de-France): Strumenti di orientamento per i giovani, dove ho contribuito al RUN front-end dell'applicazione\n- For Each Academy: creazione di un bot Discord e integrazione API per processi (creazione di canali, aggiunta di membri, ecc.)\n- For Each Academy: Sviluppo di un'applicazione per la gestione del progresso degli studenti"
  },
  "contacts": {
    "copy-clipboard-success": "Copiato nella clipboard.",
    "copy-clipboard-error": "Copia nella clipboard fallita.",
    "copy-clipboard--alt": "Icona copia nella clipboard",
    "copy-clipboard-success--alt": "Copiato nella clipboard",
    "copy-clipboard-error--alt": "Copia nella clipboard fallita",
    "email--alt": "Icona email",
    "phone--alt": "Icona telefono",
    "linkedin--alt": "Icona LinkedIn"
  },
  "resume": {
    "header": "Scarica il mio CV nella lingua che preferisci",
    "download": "Scarica",
    "flag--alt": "Cv in {language}"
  }
}
